Repository: France-ioi/AlgoreaFrontend
Catalog: src/locale/messages.*.xlf
Languages: fr

source: Unable to remove the selected user(s)
fr: Erreur lors de la suppression des utilisateurs sélectionés du groupe

source: Success
fr: Succès

source: result.countSuccess user(s) have been removed
fr: result.countSuccess utilisateur(s) ont été retirés du groupe

source: Changes successfully saved.
fr: Modifications bien enregistrées.

source: Activity associated to {{ group?.name }}
fr: Activité associée à {{ group?.name }}

source: Error while loading the root activity.
fr: Erreur lors d'un chargement de l'activité associée.

source: Root activity:
fr: Activité associée :

source: This group has no root activity.
fr: Ce groupe n'a pas d'activité associée.

source: Specific permissions given to the group on content
fr: Permissions spécifiques données au groupe sur le contenu

source: Error while loading permissions.
fr: Erreur lors du chargement des permissions.

source: Given by
fr: Donnés par

source: Given by this group
fr: Donnés par le groupe

source: This group has no specific permissions.
fr: Ce groupe n'a pas de permissions spécifiques.

source: You are not allowed to manage permissions of this group.
fr: Vous n'êtes pas autorisés à gérer les permissions de ce groupe.

source: Access to activity
fr: Accéder à cette activité

source: Group code
fr: Code du groupe

source: Failed to check code validity, please retry. If the problem persists, contact us.
fr: Erreur lors de la validation du code. Si le problème persiste, contactez-nous.

source: The provided code is invalid
fr: Le code fourni est invalide

source: Access
fr: Rejoindre

source: Items
fr: Élements

source: Edit content
fr: Editer le contenu

source: You do not have the permissions to edit this content.
fr: Vous n'avez pas les permissions d'éditer ce contenu.

source: This activity has not been correctly configured.
fr: Cette activité n'a pas été correctement configurée.

source: You need to set a url in editing mode.
fr: Vous devez configurer une URL en mode édition.

source: Your current access rights do not allow you to list<br> the content of this chapter.
fr: Vos droits d'accès actuels ne vous permettent pas de lister<br> le contenu de ce chapitre.

source: Your current access rights do not allow you to list<br> the content of this skill.
fr: Vos droits d'accès actuels ne vous permettent pas de lister<br> le contenu de cette compétence.

source: Your current access rights do not allow you to start<br> the activity.
fr: Vos droits d'accès actuels ne vous permettent pas commencer<br> cette activité.

source: Loading the content
fr: Chargement du contenu

source: The content is taking an unexpected long time to load... please wait...
fr: Ce contenu met plus de temps que prévu à se charger... veuillez patienter...

source: (not implemented)
fr: (non implémenté)

source: Your current access rights do not allow you to list the content of this chapter.
fr: Vos droits d'accès actuels ne vous permettent pas de lister le contenu de ce chapitre.

source: home page
fr: page d'accueil

source: Error while loading the item.
fr: Erreur lors du chargement du contenu.

source: Add
fr: Ajouter

source: This user is already a manager of this group.
fr: Cet utilisateur est déjà gestionnaire de ce groupe.

source: Manager added!
fr: Gestionnaire ajouté !

source: The login you entered does not exist or is not visible to you.
fr: L'identifiant que vous avez entré n'existe pas ou n'est pas visible pour vous.

source: Unable to add this manager.
fr: Erreur lors de l'ajout du gestionnaire.

source: Already added
fr: Déjà ajouté

source: No pending requests
fr: Aucune requête en attente

source: Accept
fr: Accepter

source: Reject
fr: Refuser

source: Unable to accept invitation to group "groupName"
fr: Erreur lors de l'acceptation de l'invitation du groupe "pendingRequest.group.name"

source: The groupName group has been accepted
fr: Le groupe pendingRequest.group.name a été accepté

source: Unable to reject invitation to group "groupInvitation.group.name"
fr: Erreur lors de refus de l'invitation du groupe "pendingRequest.group.name"

source: The groupInvitation.group.name group has been declined
fr: Le groupe pendingRequest.group.name a été refusé

source: Select all
fr: Tout sélectionner

source: Error while loading the activities
fr: Erreur de chargement des activités

source: There are no activities linked to this <ng-container *ngIf="observedGroupRoute$ | async as observedGroupRoute"> {(observedGroupRoute | isUser).toString(), select, true {user} other {group}}. </ng-container>
fr: Il n'y a pas activité liée à <ng-container *ngIf="observedGroupRoute$ | async as observedGroupRoute"> ce(t) {(observedGroupRoute | isUser).toString(), select, true {user} other {group}}. </ng-container>

source: Pending invitations
fr: Invitations en attente

source: Error while loading the group invitations.
fr: Erreur de chargement des invitations de groupe.

source: Title
fr: Titre

source: Requested On
fr: Demandé le

source: You are manager of <alg-group-links class="links" [items]="user.ancestorsCurrentUserIsManagerOf"></alg-group-links> of which this user is member.
fr: Vous êtes gestionnaire de <alg-group-links class="links" [items]="user.ancestorsCurrentUserIsManagerOf"></alg-group-links> dont cet utilisateur est membre.

source: Modify password
fr: Modifier le mot de passe

source: The group(s) must be empty
fr: Le(s) groupe(s) doi(ven)t être vide(s)

source: The following information is what we receive from France-IOI login platform.
fr: Les informations suivantes ont été reçue de la plateforme de connexion de France-IOI.

source: Modify
fr: Modifier

source: Name
fr: Nom

source: Can Manage
fr: Peut gérer

source: Can Watch Members
fr: Peut observer les membres

source: Can Grant Group Access
fr: Peut donner des accès aux membres

source: You do not manage any group
fr: Vous n'êtes gestionnaire d'aucun groupe

source: Joined On
fr: Membre depuis

source: This team membership is now frozen and cannot be modified.
fr: La participation à cette équipe est gelée et ne peut pas être modifiée.

source: You cannot leave this team as it would break entry condition to some content your team participating to.
fr: Vous ne pouvez pas quitter cette équipe car cela violerait les conditions d'entrée de certains contenus auxquels votre équipe participe.

source: You cannot leave the group for the moment. Contact the group manager for more information.
fr: Vous ne pouvez pas actuellement quitter le groupe. Contactez le gestionnaire de groupe pour plus d'informations.

source: Leave the group
fr: Quitter le groupe

source: This list is empty.
fr: Cette liste est vide.

source: Are you sure you want to leave this group?
fr: Êtes-vous sur de vouloir quitter ce groupe ?

source: Confirm Action
fr: Confirmer l'action

source: Yes, leave group
fr: Oui, quitter le groupe

source: Delete it
fr: L'éffacer

source: You have deleted "groupName"
fr: Vous avez effacé "groupName"

source: The user
fr: L'utilisateur

source: Personal Information
fr: Informations personnelles

source: Login
fr: Identifiant

source: First Name
fr: Prénom

source: Last Name
fr: Nom de famille

source: Birth date
fr: Date de naissance

source: Student ID
fr: ID étudiant

source: Gender
fr: Genre

source: Nationality
fr: Nationalité

source: Personal Web page
fr: Page web personnelle

source: School Information
fr: Information sur l'école

source: Your grade
fr: Année d'étude

source: Highschool graduation year
fr: Année d'obtention du diplôme d'études secondaires

source: Contact Information
fr: Information de contact

source: Primary email
fr: E-mail principal

source: Platform language
fr: Langue de la plateforme

source: The group
fr: Le groupe

source: The team
fr: L’équipe

source: Can view
fr: Visibilité

source: Can grant view
fr: Droit de donner des droits de visibilité

source: User(s) can give and revoke members access to some content
fr: L(es) utilisateur(s) peu(ven)t donner et révoquer des accès à certains contenus pour les membres

source: Can watch members
fr: Peut observer des membres

source: User(s) can watch the members' activity on some content
fr: L(es) utilisateur(s) peu(ven)t observer les activités d'autres membres sur certains contenus

source: Can watch
fr: Droit d'observation

source: Can edit
fr: Droit d'édition

source: Can attach official sessions
fr: Droit d'attacher des sessions officielles

source: {{ targetTypeString }} may attach official sessions to this item, that will be visible to everyone in the content tab of the item
fr: {{ targetTypeString }} peut associer des sessions officielles à ce contenu, celles-ci seront visibles à tous dans l'onglet "contenu"

source: Is owner
fr: Propriétaire

source: {{ targetTypeString }} own this item, and get the maximum access in all categories above, and may also delete this item
fr: {{ targetTypeString }} est propriétaire du contenu, il a donc tous les droits maximum dans les catégories ci-dessus et peut également le supprimer

source: Proceed
fr: Valider

source: Permission editor
fr: Éditeur de permissions

source: User permissions cannot be changed via this page for the moment
fr: Les permissions de l'utilisateur ne peuvent actuellement pas être changée sur cette page

source: Can list the members
fr: Peut lister les membres

source: Membership
fr: Membres

source: Can manage (add, remove, invite, ...) members
fr: Peut gérer (ajouter, supprimer, inviter, ...) des membres

source: Can manage members, managers, and change group settings
fr: Peut gérer les membres et gestionnaires, et changer les paramètres du groupe

source: Are you sure to remove from yourself the permission to edit group settings and edit managers? You may lose manager access and not be able to restore it.
fr: Êtes-vous sur de vouloir vous supprimer les droits d'éditer les paramètres du groupe et d'éditer les gestionnaires ? Vous pourriez perdre les droits de gestion et ne pas pouvoir les remettre.

source: Yes, save these changes.
fr: Oui, sauvegarder ces changements.

source: New permissions successfully saved.
fr: Nouvelles permissions sauvegardées.

source: Failed to save permissions.
fr: Erreur lors de la sauvegarde des permissions.

source: Locked and hidden
fr: Verrouillé et caché

source: Locked
fr: Verrouillé

source: Open
fr: Ouvert

source: The permissions cannot be retrieved.
fr: Erreur de récupération des permissions.

source: These are the permissions given by "{{ permReceiverName }}" to "{{ item.string.title }}" <ng-container *ngIf="(group | isUser) && permGiverName">on "{{ permGiverName }}"</ng-container>
fr: Ci-dessous les permissions données par "{{ permReceiverName }}" à "{{ item.string.title }}" <ng-container *ngIf="group.isUser && permGiverName">sur "{{ permGiverName }}"</ng-container>

source: Children
fr: Enfants

source: Enable score weight
fr: Activer les pondérations des scores

source: Non-visible content
fr: Contenu non-visible

source: No children for this chapter.
fr: Aucun enfant dans ce chapitre.

source: Error while loading the children items
fr: Erreur lors du chargement des enfants

source: Prerequisites
fr: Prérequis

source: Unable to load the prerequisites
fr: Erreur lors du chargement des prérequis

source: Retry to load prerequisites
fr: Réessayer

source: Unable to load the dependencies
fr: Erreur lors du chargement des dépendances

source: Retry to load dependencies
fr: Réessayer

source: Users will unlock access to this content if they solve <strong>at least one</strong> of the content below.
fr: Les utilisateurs débloqueront l'accès à ce contenu si ils résolvent <strong>au moins l'un</strong> des contenus ci-dessous.

source: Users will see the list of dependencies on the "content" tab and only when they do not have access to the content yet. They will only see dependencies they are allowed to view already.
fr: Les utilisateurs verront la liste des dépendances dans l'onglet "contenu" et seulement si ils l'ont pas encore accès au contenu. Ils ne verront que les dépendances qu'ils ont le droit de voir.

source: Content depending on this one
fr: Contenus qui dépendent de celui-ci

source: Only the content that is visible to you is listed. Other content may depend on it.
fr: Seuls les contenus qui vous sont visibles sont listés. D'autres peuvent également dépendre du contenu actuel.

source: There are no other content (visible to you) which depends on this one to unlock. To add some, visit this same tab on the content you want to grant access to.
fr: Il n'y a pas d'autres contenus (visibles pour vous) qui dépendent de celui-ci pour être débloqués. Pour en ajouter, visiter le même onglet sur le contenu au quel vous voulez donner accès.

source: There are no prerequisites for this {itemData.item.type, select, Skill {skill} other {activity}}. Users will have access to it only if they are given access manually or if the "default access" is configured as "open" in its parent {itemData.item.type, select, Skill {skill} Chapter {chapter} other {activity}}.
fr: Il n'y a pas de pré-requis pour cette {itemData.item.type, select, Skill {skill} other {activity}}. Les utilisateurs y auront accès si on leur a donné accès manuellement or si l'"accès par défaut" est configuré à "ouvert" dans {itemData.item.type, select, Skill {skill} Chapter {chapter} other {activity}}.

source: {VAR_SELECT, select, Skill {skill} Chapter {chapter} other {activity}}
fr: {VAR_SELECT, select, Skill {compétence} Chapter {chapitre} other {activité}}

source: You are not allowed to view dependencies for this content
fr: Vous n'êtes pas autorisé à voir les dépendances de ce contenu

source: You cannot watch other users' activity on this content
fr: Vous ne pouvez pas observer l'activité des autres utilisateurs sur ce contenu

source: Note that some subgroups or users of the groups may have higher permissions.
fr: Notez que certains sous-groupes ou utilisateurs peuvent avoir des permissions plus élevées.

source: Edit permissions
fr: Éditer les permissions

source: You are not allowed to give permissions on this content
fr: Vous n'êtes pas autorisé à donner des permissions sur ce contenu

source: You are not allowed to give permissions to this group
fr: Vous n'êtes pas autorisé à donner des permissions à ce groupe

source: You are not allowed to give permissions on this content and to this group
fr: Vous n'êtes pas autorisé à donner des permissions sur ce contenu et à ce groupe

source: {VAR_PLURAL, plural, =0 {No result found} =1 {{INTERPOLATION} result found} other {{INTERPOLATION} results found}}
fr: {VAR_PLURAL, plural, =0 {Aucun résultat trouvé} =1 {{INTERPOLATION} résultat trouvé} other {{INTERPOLATION} résultats trouvés}}

# permissionsUpdated
source: Permissions successfully updated.
fr: Permissions mises à jour.

source: Default access
fr: Accès par défaut

source: Error while loading the skill parents
fr: Erreur lors du chargement des compétences

source: This skill does not have parent skills.
fr: Cette compétence n'a pas de compétence parente.

source: Error while loading path suggestion
fr: Erreur de chargement des suggestions de chemins

source: This content is one of your root {rootItem.type, select, Skill {skill} other {activity}}
fr: Ce contenu est l'un de vos {rootItem.type, select, Skill {skill} other {activity}} racines

source: You have no path to this content.
fr: Vous n'avez pas accès à ce contenu.

source: This content can be found in...
fr: Vous pouvez accéder à ce contenu via...

source: Sub-skills
fr: Sous-compétences

source: This skill does not have subskills.
fr: Cette compétence n'a pas de sous-compétences.

source: Activities to learn or reinforce this skill
fr: Activités à apprendre pour renforcer cette compétence

source: This skill does not have related activities.
fr: Cette compétence n'a pas d'activité liée.

source: Error while loading content
fr: Erreur lors du chargement du contenu

source: You
fr: Vous

source: The user
fr: L'utilisateur

source: started the activity
fr: a commencé l'activité

source: submitted a
fr: a soumis une

source: {{ event.time | relativeTime }}
fr: {{ event.time | date : 'short' }}

source: An unknown user
fr: Un utilisateur inconnu

source: The connection with the forum has been lost, try to refresh the current page.
fr: La connexion avec le forum a été perdue, rafraichissez la page.

source: There are currently no events
fr: Il n'y actuellement pas d'évènements

source: You are helping
fr: Vous aidez

source: In this panel, you can request help from other users about the content you are on. People who have already validated this activity will see your request and be able to answer.
fr: Dans ce panneau, vous pouvez demander de l'aide d'autres utilisateurs à propos du contenu sur lequel vous êtes. Les personnes qui ont déjà validé cette activité pourront voir votre demande et pourront y répondre.

source: This thread is open
fr: Cette conversation est ouverte

source: This thread is closed
fr: Cette conversation est fermée

source: Loading thread status...
fr: Chargement du statut de la conversation ...

source: Error while loading thread info
fr: Erreur lors du chargement des infos de la conversation

source: Could not load thread
fr: Erreur lors du chargement de la conversation

source: Close this thread
fr: Fermer cette conversation

source: Open this thread
fr: Ouvrir cette conversation

source: Only the user of the thread can close it.
fr: Seul l'utilisateur concerné par la conversation peut la fermer.

source: You are not allowed to open this thread.
fr: Vous n'êtes pas autorisé à ouvrir cette conversation.

source: Error while loading this chapter's children
fr: Erreur lors du chargement des enfants de ce chapitre

source: To validate this chapter, solve at least all tasks with Validation type
fr: Pour valider ce chapitre, résolvez toutes les tâches de type Validation

source: This chapter has no content visible to you, so you can't validate it for now.
fr: Ce chapitre n'a pas de contenu que vous pouvez voir. Vous ne pouvez donc pas le valider.

source: Nothing
fr: Rien

source: targetTypeString can't see the item
fr: targetTypeString ne peut pas voir cet élément

source: targetTypeString can see the item title and description, but not its content
fr: targetTypeString peut voir cet élément

source: Content
fr: Contenu

source: targetTypeString can see the content of this item
fr: targetTypeString peut voir le contenu de cet élément

source: Content and descendants
fr: Contenu et descendants

source: targetTypeString can also see the content of this items descendants (when possible for this group)
fr: targetTypeString peut également voir le contenu de tous les descendants de cet élément (lorsque c'est possible pour ce groupe)

source: targetTypeString can also see the solution of this items and its descendants (when possible for this group)
fr: targetTypeString peut également voir les solutions de cet élément et ses descendants (quand c'est possible pour ce groupe)

source: targetTypeString can't grant any access to this item
fr: targetTypeString ne peut pas donner d'accès à cet élément

source: Info & enter
fr: Info & Entrée

source: targetTypeString can grant 'Can view: info' and 'Can enter' access
fr: targetTypeString peut donner le droit de visibilité 'info' et le droit d'entrée (si applicable)

source: targetTypeString can also grant 'Can view: content' access
fr: targetTypeString peut également donner le droit de visibilité "contenu"

source: targetTypeString can also grant 'Can view: content and descendants' access
fr: targetTypeString peut également donner le droit de visibilité "contenu et descendants"

source: targetTypeString can also grant 'Can view: solution' access
fr: targetTypeString peut également donner le droit de visibilité "solution"

source: Solution and grant
fr: Solution et transfert

source: targetTypeString can also grant 'Can grant view' access
fr: targetTypeString peut également donner le droit de donner les droit de visibilité

source: targetTypeString can't watch the activity of others on this item
fr: targetTypeString ne peut observer les utilisateurs sur cet élément

source: Result
fr: Résultats

source: targetTypeString can view information about submissions and scores of others on this item, but not their answers
fr: targetTypeString peut voir les soumissions et scores des utilisateurs sur cet élément, mais pas leurs réponses

source: Answer
fr: Réponse

source: targetTypeString can also look at other people's answers on this item
fr: targetTypeString peut également voir les réponses des autres utilisateurs sur cet élément

source: Answer and grant
fr: Réponse et transfert

source: targetTypeString can also grant 'Can watch' access to others
fr: targetTypeString peut également donner le droit d'observation à d'autres

source: targetTypeString can't make any changes to this item
fr: targetTypeString ne pas modifier cet élément

source: targetTypeString can add children to this item and edit how permissions propagate to them
fr: targetTypeString peut ajouter des enfants à cet élément et éditer comment les permissions se propagent vers eux

source: All
fr: Tout

source: targetTypeString can also edit the content of the item itself, but may not delete it
fr: targetTypeString peut également éditer le contenu de cet élément, mais pas le supprimer

source: All and grant
fr: Tout et transfert

source: This user
fr: Cet utilisateur

source: This group
fr: Ce groupe

source: This team
fr: Cette équipe

source: You
fr: Vous

source: to be at least
fr: être au moins

source: to be
fr: être

source: You need to be owner of this item
fr: Vous devez être propriétaire de cet élément

source: targetTypeString can also give 'Can edit' access to others
fr: targetTypeString peut également donner les droits d'édition à d'autres

source: Add subgroups
fr: Ajouter des sous-groupes

source: Associated {contentType, select, skill {Skill} other {Activity}}
fr: {contentType, select, skill {Skill} other {Activity}} associée

source: {VAR_SELECT, select, skill {Skill} other {Activity}}
fr: {VAR_SELECT, select, skill {Compétence} other {Activité}}

source: Attaching a skill to a group makes it available to its members at the top level of the "Skills" tab of the left panel, assuming they have been given the access rights to this skill. It also makes it easier for you to track their progress.
fr: Associer une compétence à un groupe la rend accessible à ses membres via la racine de l'onglet "Compétences" du panneau de gauche, à condition qu'ils aient reçu les droits d'accès sur cette compétence. Cela vous permet également de suivre plus facilement la progression des membres du groupe.

source: You may create a new skill folder to list all the skills you expect this group's users to work on. You may associate an existing skill if your goal is simply for members to work on this existing skill.
fr: Vous pouvez créer une nouvelle compétence parente pour répertorier toutes les compétences sur lesquelles les membres du groupe doivent travailler. Vous pouvez également associer une compétence existante si votre objectif est que les membres travaillent sur cette compétence.

source: Attaching an activity to a group makes it available to its members at the top level of the "Content" tab of the left panel, assuming they have been given the access rights to this activity. It also makes it easier for you to track their progress.
fr: Associer une activité à un groupe la rend accessible à ses membres via la racine de l'onglet "Contenu" du panneau de gauche, à condition qu'ils aient reçu les droits d'accès sur cette activité. Cela vous permet également de suivre plus facilement la progression des membres du groupe.
