Repository: France-ioi/AlgoreaFrontend
Catalog: src/locale/messages.*.xlf
Languages: fr

# auth-error-modal-title
source: Error
fr: Erreur

source: An error occurred that we cannot recover (you got a network issue?).
fr: Une erreur que nous ne pouvons résoudre est survenue (vous avez eu un problème de connexion ?).

# auth-error-modal-context
source: Oops, we are unable to make the site work properly. Are you connected to the Internet?
fr: Impossible de démarrer une session. Êtes-vous bien connecté à Internet ?

source: Reload the application.
fr: Recharger l'application.

# contactUs
source: If the problem persists, please contact us.
fr: Si le problème persiste, contactez-nous.

source: Language mismatch
fr: Mauvaise langue

source: The current language "{{ currentLanguage }}" does not correspond to your account's default language "{{ languageMismatch.userDefaultLanguage }}". Do you want to continue in this language?
fr: La langue actuelle "{{ currentLanguage }}" ne correspond pas à la langue par défaut de ce compte "{{ languageMismatch.userDefaultLanguage }}". Voulez-vous continuer dans cette langue ?

source: Continue in "{{ currentLanguage }}" and change my default language to "{{ currentLanguage }}" for this platform
fr: Continuer en "{{ currentLanguage }}" et changer ma langue par défaut par "{{ currentLanguage }}" pour cette plateforme

source: Visit the platform in "{{ languageMismatch.userDefaultLanguage }}"
fr: Visiter la plateforme en "{{ languageMismatch.userDefaultLanguage }}"

source: The platform does not exist in your default language "{{ languageMismatch.userDefaultLanguage }}".
fr: La plateforme n'existe pas dans votre langue par défaut "{{ languageMismatch.userDefaultLanguage }}".

source: Continue in "{{ currentLanguage }}" and change my default language to "{{ currentLanguage }}" for this platform.
fr: Continuer en "{{ currentLanguage }}" et changer ma langue par défaut par "{{ currentLanguage }}" pour cette plateforme.

source: The language can always be modified through your profile page.
fr: La langue peut toujours être modifiée via votre page de profil.

source: Join
fr: Rejoindre

source: Manage
fr: Gérer

source: {VAR_SELECT, select, group {You are not a member or manager of any group} other {There is no content to display}}
fr: {VAR_SELECT, select, group {Vous n'êtes membre ou gestionnaire d'aucun groupe} other {Vous n'avez accès à aucun contenu}}

source: Search ?
fr: Recherche ?

source: My groups
fr: Mes groupes

source: Join new groups and manage your memberships
fr: Rejoignez des groupes et gérez vos adhésions

source: {VAR_PLURAL, plural, =1 {via group} other {via groups}}
fr: {VAR_PLURAL, plural, =1 {via le groupe} other {via les groupes}}

source: Your current access rights do not allow you to list the content of this skill.
fr: Vos permissions actuelles ne vous permettent pas d'afficher le contenu de cette compétence.

source: Your current access rights do not allow you to start the activity.
fr: Vos permissions actuelles ne vous permettent pas de commencer l'activité.

source: You are a manager of one of the descendant of the group
fr: Vous êtes gestionnaire d'un des groupes descendants

source: You are a manager of the group
fr: Vous êtes gestionnaire du groupe

source: Skills
fr: Compétences

source: Groups
fr: Groupes

source: Unable to perform the search.
fr: Erreur lors de la recherche.

source: Unable to load the list.
fr: Erreur lors du chargement de la liste.

source: Observation mode
fr: Mode observation

source: First {{ data.length }} results
fr: {{ data.length }} premiers résultats

source: Type at least 3 letters to search content
fr: Entrez au moins 3 caractères pour rechercher

source: No results
fr: Aucun résultats

source: Only the content visible by the user you are observing ({{ observedGroup.name }}) is shown.
fr: Seulement le contenu visible par l'utilisateur que vous observez ({{ observedGroup.name }}) est montré.

source: Oops… We didn’t find that page
fr: Oups, nous n'avons pas trouvé cette page

source: Back to home page
fr: Retour sur la page d'accueil

source: This page does not exist!
fr: Cette page n'existe pas!

source: Go back to the
fr: Retour à la

source: home page
fr: accueil

source: Create a new group
fr: Créer un nouveau groupe

source: Enter a title to create a new group
fr: Entrez un titre pour créer un nouveau groupe

source: There is currently no way for you to access this content.
fr: Vous n'avez actuellement pas accès à ce contenu.

source: This content does not exist or you are not allowed to view it.
fr: Ce contenu n'existe pas ou vous n'êtes pas autorisé à le voir.

source: This page has unsaved changes. Do you want to leave this page and lose its changes?
fr: Cette page comporte des changements non sauvegardés. Voulez-vous quitter cette page et perdre les changements ?

source: Confirm Navigation
fr: Confirmation de navigation

source: Yes, leave page
fr: Oui, quitter la page

source: No
fr: Non

source: Read only
fr: Lecture seule

source: Read and edit
fr: Lecture et écriture

source: result.countSuccess manager(s) have been removed
fr: result.countSuccess gestionnaire(s) a/ont été retiré(s)

source: Unable to remove the selected manager(s).
fr: Impossible de retirer le(s) gestionnaire(s) sélectionné(s).

source: result.countSuccess manager(s) have been removed, result.countRequests - result.countSuccess could not be removed.
fr: result.countSuccess gestionnaire(s) a/ont été retiré(s), result.countRequests - result.countSuccess n'ont/a pas pu être retiré(s).

source: You have left "groupName"
fr: Vous avez quitté le groupe "groupName"

source: You have delete "itemName"
fr: Vous avez supprimé "itemName"

source: You can unlock access by validating one of the following content.
fr: Vous pouvez débloquer l'accès en validant l'un des contenus suivants.

source: Parent skills
fr: Compétence parente

source: Sub-skills
fr: Sous-compétences

source: Failed to delete "groupName"
fr: Echec lors de la suppression de "groupName"

source: Joining a new group
fr: Rejoindre un nouveau groupe

source: Do you want to join the group "{{ name }}"?
fr: Souhaitez-vous rejoindre le groupe "{{ name }}" ?

source: The managers of this group will be able to {{ params.requirePersonalInfoAccessApproval | i18nSelect : { view: 'view', edit: 'edit' } }} the personal info (firstname, lastname, email, grade, ...) you entered in your profile
fr: Les gestionnaires de ce groupe pourront {{ params.requirePersonalInfoAccessApproval | i18nSelect : { view: 'view', edit: 'edit' } }} les informations personnelles (nom, email, ...) que vous avez entré dans votre profil.

source: You will not be able to leave this group until {{ params.requireLockMembershipApprovalUntil | date: 'short' }}
fr: Vous ne pourrez pas quitter ce groupe jusqu'au {{ params.requireLockMembershipApprovalUntil | date: 'short' }}

source: Join group
fr: Rejoindre le groupe

source: Error while loading the group you joined
fr: Erreur lors du chargement du groupe que vous avez rejoint

source: Failed to leave "groupName"
fr: Impossible de quitte "groupName"

source: Group management
fr: Gestion de groupe

source: All the groups you manage
fr: Tous les groupes que vous gérez

source: Never
fr: Jamais

source: All children validated
fr: Tous les enfants validés

source: All children but one validated
fr: Tous les enfants sauf un validés

source: All 'Categories' children validated
fr: Tous les enfants 'Catégories' validés

source: One children validated
fr: Un enfant validé

source: Based on type
fr: Basé sur le type

source: Yes mapped
fr: Oui mappé

source: List
fr: Liste

source: Grid
fr: Grille

source: All the members must be admitted
fr: Tous les membres doivent être admis

source: Half of the members must be admitted
fr: La moitié des membres doivent être admis

source: One of the members must be admitted
fr: Un membre doit être admis

source: None of the members has to be admitted
fr: Aucun des membres n'a à être admis

source: You are not currently observing any group.
fr: Vous n'observez actuellement pas de groupe.

source: Unable to load the recent threads
fr: Erreur lors du chargement des discussions récentes

source: Group
fr: Groupe

source: {VAR_SELECT, select, isObserving: {View the best answer} other {Reload the best answer}}
fr: {VAR_SELECT, select, isObserving: {Voir la meilleure réponse} other {Recharger la meilleure réponse}}

source: {VAR_SELECT, select, observingMode {View answer} other {Reload answer}}
fr: {VAR_SELECT, select, observingMode {Voir la réponse} other {Recharger la réponse}}

source: Latest update
fr: Dernière mise à jour

source: Show
fr: Montrer

source: Hide
fr: Cacher

source: You have not requested any help for activities in this chapter. <br>To request help on an activity, click on the <span class="chat-icon ph-duotone ph-chats-circle"></span> button at the top of the page when visiting this activity. You cannot request help on a chapter.
fr: Vous n'avez demandé d'aide sur aucune des activités de ce chapitre. <br>Pour demander de l'aider sur une activité, cliquez sur le <span class="chat-icon ph-duotone ph-chats-circle">button at t bouton en haut de la page en visitant l'activité. Vous ne pouvez pas demander de l'aide sur un chapitre.

source: You have not requested any help for this activity. <br>To request help on this activity, click on the <span class="chat-icon ph-duotone ph-chats-circle"></span> button at the top of the page.
fr: Vous n'avez demandé d'aide sur cette activité. <br>Pour demander de l'aider sur une activité, cliquez sur le <span class="chat-icon ph-duotone ph-chats-circle">button at t bouton en haut de la page.

source: You do not have permission to ask for help on this activity.
fr: Vous n'avez pas les droits de demander de l'aide pour cette activité.

source: You don’t have access to any help request for this activity. You may only view requests attached to content you have already validated, unless you have been granted the "observing" permission on that content. Some requests may also be restricted to members of specific groups.
fr: Vous n'avez pas accès aux demandes d'aide pour cette activité. Vous ne pouvez voir les demandes liées qu'au contenu que vous avez déjà validé, à moins d'avoir les droits d'observation sur ce contenu. Certaines demandes d'aide peuvent également être limitées aux membres de certains groupes spécifiques.

source: My help requests
fr: Mes demandes d'aide

source: Other users' requests
fr: Demandes d'aide d'autres utilisateurs

source: Global parameters
fr: Paramètres globaux

source: Score & Validation
fr: Score et Validation

source: Display
fr: Affichage

source: Display header
fr: Afficher l'en-tête

source: Uses API
fr: Utilise l'API

source: This value is already used by another content. The text id must be unique across the platform.
fr: Cette value est déjà utilisée par un autre contenu. Le "text id" doit être unique à travers toute la plateforme.

source: Validation criteria
fr: Critères de validation

source: Disable score
fr: Désactiver le score

source: Display group code header
fr: Afficher l'en-tête code de groupe

source: Full screen
fr: Plein écran

source: Children layout
fr: Affichage des enfants

source: Thumbnail url
fr: Url de la vignette

source: The url should start with "https://" so that it is visible on any browser.
fr: L'URL doit commencé par "https://" afin d'être visible sur tous les navigateurs.

source: Allow multiple attempts
fr: Autoriser plusieurs tentatives

source: Start participation manually
fr: Commencer manuellement la participation

source: Duration
fr: Durée

source: First allowed entering time
fr: Heure d'entrée minimale

source: Latest allowed entering time
fr: Heure d'entrée maximale

source: Participation as a team (only)
fr: Participation en tant qu'équipe (uniquement)

source: Team
fr: Équipe

source: Freeze team on entry
fr: Geler l'équipe à l'entrée

source: Maximum team size
fr: Taille maximale de l'équipe

source: Minimum admitted members
fr: Nombre minimal de membres admis

source: Error while loading the data
fr: Erreur lors du chargement des données

source: This group has no {currentFilter, select, Users {users} Teams {teams} other {sub-groups}}
fr: Ce groupe n'a {currentFilter, select, Users {users} Teams {teams} other {sub-groups}}

source: {VAR_SELECT, select, Users {users} Teams {teams} other {sub-groups}}
fr: {VAR_SELECT, select, Users {aucun utilisateur} Teams {aucune équipe} other {aucun sous-groupe}}

source: Export as CSV
fr: Exporter en CSV

source: Could not load more results, are you connected to the internet?
fr: Erreur lors du chargement des résultats, êtes-vous connecté à Internet ?

source: Save
fr: Sauvegarder

source: Cancel Changes
fr: Annuler les changements

source: The action cannot be executed. If the problem persists, contact us.
fr: Cette action ne peut être exécutée. Contactez-nous si le problème persiste.

source: Add a content
fr: Ajouter du contenu

source: Error while fetching author info
fr: Erreur lors du chargement des informations de l'auteur

source: Edit it
fr: Éditer

source: Back to your current answer
fr: Retour à votre réponse actuelle

source: Submitted by <ng-container *ngIf="author.groupId === info.currentUserId; else otherUser"> yourself </ng-container><ng-template #otherUser><a [routerLink]="groupLink$ | async" class="alg-link base-color">{{ author | userCaption }}</a></ng-template> on {{ answer.createdAt | date:'short' }}.
fr: Soumis par <ng-container *ngIf="author.groupId === userProfile?.groupId; else otherUser"> vous-même </ng-container><ng-template #otherUser><a [routerLink]="groupLink$ | async" class="alg-link base-color">rCaption }}</ng-te</ng-template> le {{ answer.createdAt | date:'short' }}.

source: Enter a title to create a new child
fr: Entrez un titre afin de créer un nouveau contenu

source: Generate a new code and reset expiration
fr: Générer un nouveau code et réinitialiser l'expiration

source: Disable code access
fr: Désactiver l'accès par code

source: Days
fr: Jours

source: Hours
fr: Heures

source: Seconds
fr: Secondes

source: Enter at least 3 characters
fr: Entrez au moins 3 caractères

source: or
fr: ou

source: Search for existing content
fr: Chercher parmi les contenus existants

source: Select the type of group to create
fr: Sélectionnez le type de groupe à créer

source: Task URL
fr: URL de la tâche

source: An error occurred while searching. If the problem persists, please contact us.
fr: Erreur lors de la recherche. Si le problème persiste, veuillez nous contacter.

source: Select a content among those which already exist
fr: Sélectionnez un contenu parmi les existants

source: No records found
fr: Aucun résultat

source: More than 10 results match your search terms. If you have not found what you are looking for, make your search more specific.
fr: Plus de 10 résultats correspondent à votre recherche. Si vous n'avez pas trouvé ce que vous cherchiez, soyez plus spécifique dans votre recherche.

source: Edit
fr: Éditer

source: History
fr: Historique

source: Dependencies
fr: Dépendances

source: Parameters
fr: Paramètres

source: Leave unsaved task
fr: Ne pas sauvegarder la réponse

source: You do not appear to be connected to the Internet, if you leave this task you may loose your progress. Are you sure you want to continue?
fr: Vous ne semblez pas être connecté à Internet, si vous quittez cette tâche, vous perdrez vos changements. Êtes-vous sûr de vouloir continuer ?

source: Loose progress and leave the task
fr: Perdre les changement et quitter la tâche

source: Retry
fr: Réessayer

# unknownError
source: An unknown error occurred.
fr: Une erreur est survenue.

source: Unable to load the task
fr: Erreur lors du chargement de la tâche

source: It usually occurs when task url is invalid. If the task url is valid and the problem persists, please contact us.
fr: Cela se produit lorsque l'url de la tâche est invalide. Si l'url est valide et que le problème persiste, contactez-nous.

source: Error while requesting task metadata
fr: Erreur lors du chargement des métadonnées de la tâche

source: Show task anyway (for debugging)
fr: Montrer la tâche tout de même (pour debugguer)

source: Unable to load the answer
fr: Erreur lors du chargement de la réponse

source: Unable to load the answer, <a [routerLink]="error.fallbackLink" class="alg-link">back to the regular task page</a>.
fr: Erreur lors du chargement de la réponse, <a [routerLink]="error.fallbackLink" class="alg-link">retour à la tâche brute</a>.

source: Saving answer...
fr: Sauvegarde de la réponse ...

source: Skip
fr: Passer

source: You are not allowed to view the progress of other users on this content.
fr: Vous n'êtes pas autorisé à suivre la progression d'autres utilisateurs sur ce contenu.

source: You are not allowed to view this content.
fr: Vous n'êtes pas autorisé à voir ce contenu.

source: You are not allowed to view this content.
fr: Vous n'êtes pas autorisé à voir ce contenu.

source: Your current progress could not have been saved. Are you connected to the internet?
fr: Erreur lors de la sauvegarde de votre progression. Êtes-vous connecté à Internet ?

source: Progress saved!
fr: Progression sauvegardée !

source: You might be unauthenticated anymore, please try relaunching the exercise. If the problem persits contact us.
fr: Vous êtes peut-être déconnecté ? Essayez de recharger la tâche. Si le problème persiste, contactez-nous.

source: An unknown error occurred while publishing your result
fr: Erreur lors de la publication de vos résultats

source: Hint request failed
fr: Erreur lors de la demande d'indice

source: You cannot access this page.
fr: Vous n'avez pas les droits d'accéder à cette page.

source: Unable to get linked page information. If the problem persists, contact us.
fr: Erreur lors de la récupération des informations de la page. Si le problème persiste, contactez-nous.

source: Solve
fr: Résoudre

source: Hints
fr: Indices

source: Progress
fr: Avancement

source: Leave the group?
fr: Quitter le groupe ?

source: Select
fr: Sélectionner

source: You don't have access to this
fr: Vous n'avez pas accès à cette

source: activity
fr: activité

source: skill
fr: compétence

source: The configured
fr: Vous n'avez pas accès à la

source: is currently not visible to you.
fr: configurée.

source: All descendants
fr: Tous les descendants

source: Class
fr: Classe

source: Base
fr: Système

source: Friends
fr: Amis

source: Other
fr: Autre

source: Group successfully created
fr: Groupe créé avec succès

source: This field is required
fr: Ce champ est requis

source: This field is too short, minimum : {{err.requiredLength}} characters.
fr: Ce champ est trop court, minimum : {{err.requiredLength}} caractères.

source: This field is too long, maximum : {{err.requiredLength}} characters.
fr: Ce champ est trop long, maximum : {{err.requiredLength}} caractères.

source: Invalid value, minimum: {{ err.min }}
fr: Valeur invalide, minimum: {{ err.min }}

source: Invalid value, maximum: {{ err.max }}
fr: Valeur invalide, maximum: {{ err.max }}

source: Invalid duration
fr: Durée invalide

source: Invalid date
fr: Date invalide

source: The date must be greater than: {{ err.minDate | date: 'dd/MM/yyyy HH:mm' }}
fr: La date doit être postérieure à : {{ err.minDate | date: 'dd/MM/yyyy HH:mm' }}

source: Chapter
fr: Chapitre

source: A new folder which can contain any activities.
fr: Un nouveau dossier qui peut contenir des activités.

source: Empty task
fr: Tâche vide

source: A new task which will be configured later.
fr: Nouvelle tâche configurée plus tard.

source: Task
fr: Tâche

source: A new task configured with a given url.
fr: Une nouvelle tâche avec une URL donnée.

source: Skill
fr: Compétence

source: A new skill.
fr: Une nouvelle compétence.

source: All with grant
fr: Tout + transfert

source: Enter
fr: Entrer

source: Content with descendants
fr: Contenu et descendants

source: Solution with grant
fr: Solution et "grant"

source: Answer with grant
fr: Réponse + transfert

source: Submission
fr: Soumission

source: Statement
fr: Énoncé

source: Submission (score: score)
fr: Soumission (score: score)

source: Activity started
fr: Activité commencée

source: Activity validated
fr: Activité validée

source: Current answer
fr: Réponse actuelle

source: Saved answer
fr: Réponse sauvegardée

source: Just now
fr: Il y a quelques secondes

source: 1 month ago
fr: Il y a 1 mois

source: Closed
fr: Fermé

source: Saving answer before loading submission...
fr: Sauvegarde de la réponse pour charger une soumission...

source: Maformed url: "url"
fr: URL invalide: "url"

source: Invalid url "url": please provide an http(s) link
fr: URL invalide "url": fournissez un lien "http(s)"

source: Invalid url, please provide a secure task url (https)
fr: URL invalide, fournissez une url HTTPS

source: Unable to load this task. Either you have a connection issue or this task is not correctly configured. Please retry, if the problem persists, contact us.
fr: Erreur lors du chargement de cette tâche. Soit vous avez un problème de connexion, soit cette tâche est mal configurée. Veuillez réessayer. Si le problème persiste, contactez-nous.

source: This task is not correctly configured (chapter with tasks expected).
fr: Cette tâche est mal configurée (le chapitre devrait comporter des tâches).

source: This task is not correctly configured (item not found or explicit entry but no result)
fr: Cette tâche est mal configurée (contenu non trouvé ou entrée explicite sans "result")

source: Something wrong occurred during the login process, please retry after closing this tab or window.
fr: Une erreur est parvenue lors du login, veuillez réessayer après avoir fermé cet onglet ou cette fenêtre.

source: Join
fr: Rejoindre

source: Cancel
fr: Annuler

source: Remove all members
fr: Retirer tous les membres

source: Remove and re-invite all members
fr: Retirer et réinviter tous les membres

source: You are already a member of this group.
fr: Vous êtes déjà membre de ce groupe.

source: You cannot join this team as it would conflict with another team you belong to.
fr: Vous ne pouvez pas rejoindre cette équipe, cela est incompatible avec une autre équipe à laquelle vous appartenez.

source: This group does not allow any membership change.
fr: Ce groupe ne permet plus de changement de membre.

source: No group corresponds to this code.
fr: Aucun groupe ne correspond à ce code.

source: You cannot join this team as it would break the entry conditions of content it is participating to.
fr: Vous ne pouvez pas rejoindre cette équipe, c'est incompatible avec certains contenus dans lesquels cette équipe est engagée.

source: Error
fr: Erreur

source: You are not allowed to watch the group for which you have requested observation.
fr: Vous n'êtes pas autorisé d'observer le groupe que vous demandez d'observer.

source: Something went wrong while enabling group observation. If the problem persists, please contact us.
fr: Erreur lors de l'activation du mode observation. Si le problème persiste, contactez-nous.

source: Close
fr: Fermer

source: Only owner can delete items
fr: Seuls les propriétaires d'un contenu peuvent le supprimer

source: Error while loading the item info
fr: Erreur lors du chargement des informations du contenu

source: Only empty chapters can be deleted.
fr: Un chapitre doit être vide pour pouvoir être supprimé.

source: Only empty skills can be deleted.
fr: Une compétence doit être vide pour pouvoir être supprimée.

source: Delete this item
fr: Supprimer ce contenu

source: Deleting it will also remove permanently all answers and results related with this content.
fr: Le supprimer supprimera également définitivement toutes les réponses et résultats liés à ce contenu.

source: Are you sure you want to delete this content?
fr: Êtes-vous sur de vouloir supprimer ce contenu ?

source: Yes
fr: Oui
