Repository: France-ioi/AlgoreaFrontend
Catalog: src/locale/messages.*.xlf
Languages: fr

source: You may create a new chapter folder to list all the content you expect this group's users to work on. You may associate an existing chapter if your goal is simply for members to work on this existing content.
fr: Vous pouvez créer un nouveau chapitre pour répertorier tout le contenu sur lequel les membres du groupe doivent travailler. Vous pouvez également associer un chapitre existant si votre objectif est que les membres travaillent sur ce contenu.

source: Error while loading the root {contentType, select, skill {skill} other {activity}}
fr: Erreur de chargement de la {contentType, select, skill {skill} other {activity}} racine

source: {VAR_SELECT, select, skill {skill} other {activity}}
fr: {VAR_SELECT, select, skill {compétence} other {activité}}

source: There are currently no {contentType, select, skill {skills} other {activities}} associated with this group.
fr: Il n'y a actuellement pas de {contentType, select, skill {skills} other {activities}} associée à ce groupe.

source: {VAR_SELECT, select, skill {skills} other {activities}}
fr: {VAR_SELECT, select, skill {compétences} other {activités}}

source: teams
fr: équipes

source: users
fr: utilisateurs

source: Team activities are currently not supported
fr: Les activités en équipe ne sont actuellement pas supportées

source: sub-groups
fr: sous-groupes

source: You are a member of this group.
fr: Vous êtes membre de ce groupe.

source: As a member of <alg-group-links class="links" [items]="group?.descendantsCurrentUserIsMemberOf"></alg-group-links> you are a member of this group.
fr: En tant que membre de <alg-group-links class="links" [items]="group?.descendantsCurrentUserIsMemberOf"></alg-group-links>, vous êtes également membre de ce groupe.

source: <i class="icon ph-duotone ph-crown"></i> You are a manager of this group.
fr: <i class="icon ph-duotone ph-crown"></i> Vous êtes gestionnaire du groupe.

source: <i class="icon ph-duotone ph-crown"></i> As a manager of <alg-group-links class="links" [items]="group?.ancestorsCurrentUserIsManagerOf"></alg-group-links> you can manage this group.
fr: <i class="icon ph-duotone ph-crown"></i> En tant que gestionnaire du groupe <alg-group-links class="links" [items]="group?.ancestorsCurrentUserIsManagerOf"></alg-group-links>, vous êtes également gestionnaire de ce groupe.

source: <i class="icon ph-duotone ph-crown"></i> As a manager of <alg-group-links class="links" [items]="group?.descendantsCurrentUserIsManagerOf"></alg-group-links> you can view this group.
fr: <i class="icon ph-duotone ph-crown"></i> En tant que gestionnaire de <alg-group-links class="links" [items]="group?.descendantsCurrentUserIsManagerOf"></alg-group-links>, vous pouvez voir ce groupe.

source: Member Since
fr: Membre depuis

source: User Count
fr: Nombre d'utilisateurs

source: Parent group(s)
fr: Groupe(s) parent(s)

source: Member(s)
fr: Membre(s)

source: Could not load more members, are you connected to the internet?
fr: Erreur de chargement des membres, êtes-vous connecté à Internet ?

source: Could not load more logs, are you connected to the internet?
fr: Erreur de chargement de la liste d'activités, êtes-vous connectés à Internet ?

source: Are you sure you want to permanently delete getSelectedGroupChildCaptions(this.selection as GroupChild[])? This operation cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer définitivement getSelectedGroupChildCaptions(this.selection as GroupChild[])? Cette opération est irréversible.

source: By removing getSelectedGroupChildCaptions(this.selection as GroupChild[]) from the group, you may loose manager access to them (if no explicit permission or through other parent group). Are you sure you want to proceed?
fr: En retirant getSelectedGroupChildCaptions(this.selection as GroupChild[]) du groupe, vous pourriez perdre les droits de gestion vers les membres de ce groupe (si vous n'avez pas de permissions explicite ou via un autre groupe parent). Êtes-vous sûr de vouloir continuer ?

source: Do you also want to delete the group?
fr: Voulez-vous également supprimer ce groupe ?

source: These groups are all empty. Do you also want to delete them?
fr: Ces groupes sont tous vides, voulez-vous également les supprimer ?

source: Error while loading the group members
fr: Error lors du chargement des membres du groupes

source: Load more
fr: Voir plus

source: This list is empty. Check below the different ways to add members or sub-groups.
fr: La liste est vide. Voyez ci-dessous comment vous pouvez ajouter des membres et sous-groupes.

source: Select all
fr: Tout sélectionner

source: {VAR_SELECT, select, users {Remove} other {Remove from group}}
fr: {VAR_SELECT, select, users {Supprimer} other {Supprimer du groupe}}

source: Read-only
fr: Lecture seule

source: Memberships
fr: Membres

source: Memberships & Group
fr: Membres & Groupe

source: None
fr: Rien

source: {{ group?.name }}: manager access given to {{ userCaption }}
fr: {{ group?.name }}: accès gestionnaire donné à {{ userCaption }}

source: This panel lets you select what you allow the selected user or group of users to do on the current group and its descendants.
fr: Ce panneau vous permet de sélectionner ce que vous autorisez l'utilisateur ou le groupe d'utilisateur de faire sur le groupe actuel et ses descendants.

source: Management level
fr: Niveau d'autorisation

source: The permissions that the user(s) has on this group
fr: Les permissions que cet/ces utilisateur(s) a/ont sur ce groupe

source: Can grant access
fr: Peut donner accès

source: result.countSuccess group(s) have been removed
fr: result.countSuccess groupe(s) a/ont été supprimé(s)

source: Unable to remove the selected group(s).
fr: Erreur lors de la suppression du/des groupe(s).

source: result.countSuccess group(s) have been removed, result.countRequests - result.countSuccess could not be removed.
fr: result.countSuccess groupe(s) a/ont été supprimé(s), result.countRequests - result.countSuccess n'a/ont pas pu être supprimé(s).

source: Error while loading the group you manage
fr: Erreur lors du chargement des groupes dont vous êtes gestionnaire

source: Memberships and group
fr: Membres et groupe

source: Are you sure to remove yourself from the managers of this group? You may lose manager access and not be able to restore it.
fr: Êtes-vous sûr de vouloir vous retirer des gestionnaires du groupe? Vous pourriez perdre des droits de gestion et ne pas pouvoir les restaurer.

source: Yes, remove me from the group managers
fr: Oui, me retirer des gestionnaires du groupe

source: Error while loading the group managers
fr: Erreur lors du chargement des gestionnaires de groupe

source: Managers of this group
fr: Gestionnaires de ce groupe

source: Name
fr: Nom

source: Required approvals
fr: Approbations obligatoires

source: If you enable some of the rules below, users joining the group will have to approve them first.
fr: Si vous activez certaines des règles ci-dessous, les utilisateurs devront les approuver pour rejoindre le groupe.

source: Lock membership until a given date
fr: Interdire de quitte le groupe jusqu'à une certaine date

source: Managers can access member's personal information
fr: Les gestionnaires peuvent accéder aux informations personnelles des membres

source: As you have strengthened approval conditions, all group members have to re-approve the new conditions
fr: Vu que vous avez renforcé les conditions à accepter, tous les membres actuels du groupe doivent ré-approuver ces nouvelles conditions.

source: Can Manage
fr: Peut gérer

source: Can grant group access
fr: Peut donner des droits

source: Can watch members
fr: Peut observer les membres

source: This group has no dedicated managers.
fr: Ce groupe n'a pas de gestionnaires dédiés.

source: successInvites.length user(s) invited successfully:
fr: successInvites.length utilisateur(s) invité(s) avec succès :

source: alreadyInvited.length user(s) have already been invited:
fr: alreadyInvited.length utilisateur(s) a/ont déjà été invité(s) :

source: notFoundUsers.length user login(s) not found:
fr: notFoundUsers.length identifiant(s) d'utilisateur(s) non trouvé(s) :

source: invalidInvites.length user login(s) could not be invited:
fr: invalidInvites.length utilisateur(s) n'a/ont pas pu être invité(s) :

source: Let users join using a code
fr: Rejoindre en utilisant un code de groupe

source: Invite users
fr: Inviter des utilisateurs

source: Add users name list, separated by commas.
fr: Entez une liste d'identifiants d'utilisateur, séparés par des virgules.

source: login_1, login_2...
fr: identifiant_1, identifiant_2, ...

source: You cannot invite more than 100 users at once
fr: Vous ne pouvez pas inviter plus de 100 utilisateurs à la fois

source: Invite
fr: Inviter

source: A new code has been generated
fr: Un nouveau code a été généré

source: The validity has been changed
fr: La validité a été modifiée

source: Users will not be able to join with the former code.
fr: Les utilisateurs ne pourront plus rejoindre le groupe avec le code précédent.

source: You are currently not allowed to leave this group.
fr: Vous n'êtes actuellement pas autorisé à quitter ce groupe.

source: You can freely leave this group. Note that you may lose access to content if this group was granting some permissions to its members.
fr: Vous pouvez librement quitter ce groupe. Notez que vous pourriez perdre accès à certains contenus si l'accès à ceux-ci vous y était donné par ce groupe.

source: Leave this group
fr: Quitter ce groupe

source: You've left group
fr: Vous avez quitté le groupe

source: , and
fr: et

source: {{ (items || []).length - maxItemsDisplay + 1 }} more
fr: {{ (items || []).length - maxItemsDisplay }} autres

source: You are not allowed to see activities of this user.
fr: Vous n'êtes pas autorisé à voir les activités de cet utilisateur.

source: Let users access this group using a password you send them.
fr: Permet aux utilisateurs de rejoindre ce groupe en utilisant un mot de passe que vous leur donnez.

source: There is currently no code set.
fr: Il n'y a pas de code actuellement défini.

source: This code has not been used yet (or usage resetted).
fr: Ce code n'a pas encore été utilisé (ou a été réinitialisé).

source: This code can be used multiple times without expiring.
fr: Ce code peut être utilisé plusieurs fois sans expirer.

source: This code has been activated {{ codeInfo.durationSinceFirstCodeUse | toMin | number:'1.0-0' }} minutes ago, it will be disabled in {{ codeInfo.durationBeforeCodeExpiration | toMin | number:'1.0-0' }} minutes.
fr: Ce code a été activé il y a tivated {{ groupExt.durationSinceFirstCodeUse! | toMin | number:'1 minutes, il sera désactivé dans be disabled in {{ groupExt.durationBeforeCodeExpiration! | toMin | n minutes.

source: This code will be disabled in {{ codeInfo.durationBeforeCodeExpiration | toMin | number:'1.0-0' }} minutes.
fr: Ce code sera désactivé dans {{ codeInfo.durationBeforeCodeExpiration | toMin | number:'1.0-0' }} minutes.

source: This code has expired on {{ codeInfo.codeExpiration | date:'medium' }}
fr: Ce code a expiré le ired on {{ groupExt.codeExpiration | date:'m

source: Generate a code
fr: Générer un code

source: Validity
fr: Validité

source: Infinite
fr: Infini

source: This code will never expire
fr: Ce code n'expirera jamais.

source: (reset current expiration)
fr: (réinitialise l'expiration)

source: Usable once
fr: Utilisable 1x

source: This code will be usable only once
fr: Ce code ne sera utilisable qu'une seule fois

source: Custom
fr: Personnalisée

# expireDuration
source: This code will expire after the given duration
fr: Ce code expirera après une durée précise

source: You are not allowed to see this page.
fr: Vous n'êtes pas autorisé à visiter cette page.

source: Only an empty group can be deleted.
fr: Seul un groupe vide peut être supprimé.

source: Are you sure you want to delete the group "this.group.name"
fr: Êtes-vous sûr de vouloir supprimer le groupe "this.group.name"

source: You need to solve all the errors displayed in the form to save changes.
fr: Vous devez résoudre toutes les erreurs affichées dans le formulaire avant de sauvegarder.

source: Associated activity:
fr: Activité associée :

source: Item title
fr: Titre

source: Item subtitle
fr: Sous-titre

source: There is no progress to report for this item.
fr: Il n'y a pas de progression sur ce contenu.

source: «{{ observedGroup.name }}» {(watchedGroupPermissions | allowsViewingContent).toString(), select, true {can} other {can't}} access this {itemData.item.type, select, Skill {skill} other {activity}}
fr: «{{ observedGroup.name }}» {(watchedGroupPermissions | allowsViewingContent).toString(), select, true {can} other {can't}} accéder à cette {itemData.item.type, select, Skill {skill} other {activity}}

source: {VAR_SELECT, select, true {can} other {can't}}
fr: {VAR_SELECT, select, true {peut} other {ne peut pas}}

source: {VAR_SELECT, select, Skill {skill} other {activity}}
fr: {VAR_SELECT, select, Skill {compétence} other {activité}}

source: You cannot watch this {itemData.item.type, select, Skill {skill} other {activity}}
fr: Vous ne pouvez pas observer cette {itemData.item.type, select, Skill {skill} other {activity}}

source: The {(observedGroup.route | isUser).toString(), select, true {user} other {group}} cannot currently view this content.
fr: {(observedGroup.route | isUser).toString(), select, true {user} other {group}} ne peut actuellement pas voir ce contenu.

source: The {(observedGroup.route | isUser).toString(), select, true {user} other {group}} can list this {itemData.item.type, select, Skill {skill} other {activity}} but cannot {itemData.item.type, select, Task {view its content} other {list its content}}.
fr: L(e) {(observedGroup.route | isUser).toString(), select, true {user} other {group}} peut voir cette {itemData.item.type, select, Skill {skill} other {activity}} mais ne pas peut pas {itemData.item.type, select, Task {view its content} other {list its content}}.

source: {VAR_SELECT, select, Task {view its content} other {list its content}}
fr: {VAR_SELECT, select, Task {voir son contenu} other {lister son contenu}}

source: {VAR_SELECT, select, true {user} other {group}}
fr: {VAR_SELECT, select, true {utilisateur} other {groupe}}

source: You do not have the permissions to edit this content.
fr: Vous n'avez pas les permissions d'éditer ce contenu.

source: Error while loading the group
fr: Erreur de chargement du groupe

source: Group information
fr: Informations du groupe

source: Unable to load the recent activity
fr: Erreur lors du chargement les activités récentes

source: There is no progress to report for this group/user.
fr: Il n'y a pas de progression pour ce(t) groupe/utilisateur.

source: Action
fr: Opération

source: User
fr: Utilisateur

source: Time
fr: Date/Heure

source: Add a manager
fr: Ajouter un gestionnaire

source: Login of a user
fr: Se connecter en tant qu'un utilisateur

source: Time spent
fr: Temps écoulé

source: Not started
fr: Non commencé

source: (using {rowData.hintsRequested, plural, =1 {hint} other {{{ rowData.hintsRequested }} hints}})
fr: (avec {rowData.hintsRequested, plural, =1 {hint} other {{{ rowData.hintsRequested }} hints}})

source: {VAR_PLURAL, plural, =1 {hint} other {{INTERPOLATION} hints}}
fr: {VAR_PLURAL, plural, =1 {indice} other {{INTERPOLATION} indices}}

source: You cannot view answers for this content.
fr: Vous ne pouvez pas voir les réponses pour ce contenu.

source: View answer
fr: Voir la réponse

source: This user has this permission via one of the other group he is member of, or one of their ancestors.
fr: Cet utilisateur a reçu cette permission via un autre groupe dont il est membre, ou l'un de ses ancêtres.

source: This group has this permission via one of one of its ancestor group.
fr: Ce groupe a reçu cette permission par l'un de ses groupes ancêtres.

source: Error while loading the group progress
fr: Erreur lors du chargement de la progression du groupe

source: Error while loading the user progress
fr: Erreur lors du chargement de la progression de l'utilisateur

source: Latest activity
fr: Dernière activité

source: The groups you joined
fr: Groupes dont vous êtes membre

source: Join a group by code
fr: Rejoindre un groupe par code

source: The groups you manage
fr: Groupes dont vous êtes gestionnaire

source: You need to be logged in to manage and create groups
fr: Vous devez être connecté pour gérer et créer des groupes

source: To join a group, you first have to log in or sign in using the top right button.
fr: Pour rejoindre un groupe, vous devez vous connecter ou vous inscrire en utilisant le bouton en haut à droite

source: Error while loading the pending requests.
fr: Erreur lors du chargement des requêtes.

source: Grade:
fr: Année d'étude:

source: Manage groups
fr: Gestion des groupes

source: Overview
fr: Général

source: Managers
fr: Gestionnaires

source: Settings
fr: Paramètres

source: You are not allowed to view this group page.
fr: Vous n'êtes pas autorisé à voir cette page de groupe.

source: Access
fr: Accès

source: Error while loading the group info
fr: Error lors du chargement du groupe

source: Delete this group
fr: Supprimer ce groupe

source: Group successfully added as child group
fr: Group ajouter avec succès

source: Settings
fr: Paramètres

source: Add a new prerequisite
fr: Ajouter un nouveau prérequis

source: Error while loading the user info
fr: Erreur de chargement des informations de l'utilisateur

source: Progress
fr: Progression

source: Personal data
fr: Données personnelles

source: You cannot access this page for this user
fr: Vous ne pouvez pas accéder à cette page pour cet utilisateur

source: Users
fr: Utilisateurs

source: Sub-groups
fr: Sous-groupes

source: Enter a title to create a new dependency
fr: Entrez un titre pour créer une nouvelle dépendance

source: Personal info
fr: Informations personnelles

source: Presentation
fr: Présentation

source: This group has no description
fr: Ce groupe n'a pas de description

source: Partial success
fr: Succès partiel

source: result.countSuccess user(s) have been removed, result.countRequests - result.countSuccess could not be removed
fr: result.countSuccess utilisateur(s) ont été retirés, result.countRequests - result.countSuccess n'ont pas pu être retiré du groupe
